# Основы pandas

In [3]:
import pandas as pd

Пример забора данных с сайтов

In [4]:
import pymysql

connection

ModuleNotFoundError: No module named 'pymysql'

In [5]:
pd.read_sql('select * from db.table;', connection)

NameError: name 'connection' is not defined

In [6]:
pd.read_html('http://www.cbr.ru')[0]

ValueError: No tables found

In [58]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [59]:
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  13.03.21    735640    735640    735640   735640
 1  12.03.21    735640    733209    737450   732250
 2  11.03.21    733210    735773    738680   731780
 3  10.03.21    735772    740650    742526   735596
 4  09.03.21    740890    745204    746463   737790
 5  08.03.21    745203    743490    748750   738840
 6  07.03.21    743270    743270    744470   743260
 7  06.03.21    743630    744405    744405   743630
 8  05.03.21    744405    746593    748350   741045
 9  04.03.21    746592    739790    749730   733448,
        Имя  Unnamed: 1     %     курс                 Дата
 0  EUR/RUB         NaN     0    87557  13.03.2021 12:30:00
 1  USD/RUB         NaN     0    73564  13.03.2021 12:30:00
 2  CHF/RUB         NaN  4283   791371  13.03.2021 15:29:00
 3  JPY/RUB         NaN  4593      675  13.03.2021 15:29:00
 4  GBP/RUB         NaN  4295  1024086  13.03.2021 15:29:00
 5  NOK/RUB         NaN  4259    87238  13.03.2021 15:29:00
 6  AUD/RUB         NaN  3725   570836  13.03.2021 15:29:00
 7  NZD/RUB         NaN  4125   527956  13.03.2021 15:29:00
 8  TRY/RUB         NaN  3925    97256  13.03.2021 15:29:00]

Импорт данных из файла

In [10]:
csv - comma

NameError: name 'csv' is not defined

In [12]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [6]:
data.head(30)

    country  year  quantity  category
0   Austria  1996       5.0         1
1   Austria  1995      17.0         1
2   Belgium  2014       0.0         1
3   Belgium  2013       0.0         1
4   Belgium  2012      35.0         1
5   Belgium  2011      25.0         1
6   Belgium  2010      22.0         1
7   Belgium  2009      45.0         1
8   Czechia  1998       1.0         1
9   Czechia  1995       7.0         1
10  Finland  2010       9.0         1
11  Finland  2009      13.0         1
12  Finland  2008      39.0         1
13  Finland  2007      21.0         1
14  Finland  2006       0.0         1
15  Finland  2005       0.0         1
16  Finland  2004       0.0         1
17  Finland  2003       0.0         1
18  Finland  2002       0.0         1
19  Finland  2001       0.0         1
20  Finland  2000       0.0         1
21  Finland  1999       0.0         1
22  Finland  1998       0.0         1
23  Finland  1997       0.0         1
24  Finland  1996       0.0         1
25  Finland  1995       3.0         1
26   France  2014     119.0         1
27   France  2013     102.0         1
28   France  2012      62.0         1
29   France  2011      55.0         1

In [7]:
data.tail(10)

          country  year  quantity  category
1189472   Vanuatu  2010      5.17        71
1189473   Vanuatu  2009      5.63        71
1189474   Vanuatu  2008      5.63        71
1189475  Viet Nam  2014    300.00        71
1189476  Viet Nam  2013     92.00        71
1189477  Viet Nam  2012     92.00        71
1189478  Viet Nam  2011     87.00        71
1189479  Viet Nam  2010     50.00        71
1189480  Viet Nam  2009     10.00        71
1189481  Viet Nam  2008      1.00        71

In [8]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
data.

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [13]:
?pd.read_csv

In [10]:
# количество строк в датафрейме

len(data)

1189482

In [11]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [14]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Основные сведения о датафрейме

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 5 columns):
country          1189482 non-null object
year             1189482 non-null int64
quantity         1189482 non-null float64
category         1189482 non-null int64
year_plus_one    1189482 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 45.4+ MB

In [15]:
2**64

18446744073709551616

In [16]:
None

In [17]:
# немного статистики

data.describe()

               year      quantity      category  year_plus_one
count  1.189482e+06  1.189482e+06  1.189482e+06   1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01   2.003852e+03
std    7.167345e+00  1.585663e+07  1.809968e+01   7.167345e+00
min    1.990000e+03 -8.643480e+05  1.000000e+00   1.991000e+03
25%    1.997000e+03  1.400000e+01  2.400000e+01   1.998000e+03
50%    2.003000e+03  1.890000e+02  3.500000e+01   2.004000e+03
75%    2.009000e+03  2.265000e+03  5.100000e+01   2.010000e+03
max    2.014000e+03  6.680329e+09  7.100000e+01   2.015000e+03

### Отдельный столбец (тип Series)

In [19]:
data['year_plus_one'].head()

0    1997
1    1996
2    2015
3    2014
4    2013
Name: year_plus_one, dtype: int64

In [20]:
# или так

data.year_plus_one.head()

0    1997
1    1996
2    2015
3    2014
4    2013
Name: year_plus_one, dtype: int64

In [18]:
type(data['year'])

pandas.core.series.Series

In [19]:
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

In [20]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71])

In [21]:
set([1, 1, 1, 2])

{1, 2}

In [22]:
len(data['category'].unique())

71

In [23]:
data['category'].nunique()

71

In [ ]:
data['category'].head()

In [25]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(100)

67    133916
27     97645
24     75132
42     64161
37     62156
       ...
69       684
30       496
26       365
49       105
66        58
Name: category, Length: 71, dtype: int64

In [25]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

# Фильтры

In [26]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [27]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [ ]:
data['country']

In [28]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [27]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [28]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [29]:
f'quantity > {average_level}'

'quantity > 184264.77005012965'

In [30]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

NameError: name 'country_stats' is not defined

In [ ]:
if data.quantity > average_level:

In [26]:
# самый популярный способ

data[ data.quantity > average_level ].head()

NameError: name 'average_level' is not defined

### Как определить используемый вариант названия страны?

In [31]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [32]:
if 'rus' in 'Russia Federation':

SyntaxError: unexpected EOF while parsing (<ipython-input-32-0670c1c84480>, line 1)

In [33]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [36]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [37]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [38]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [35]:
# Сортировка по столбцу

data.sort_values(by='quantity').head(20)

                   country  year  quantity  category  year_plus_one
832375       United States  2000 -864348.0        42           2001
832373       United States  2002 -562414.0        42           2003
832362       United States  2013 -551490.0        42           2014
832380       United States  1995 -493380.0        42           1996
832322             Ukraine  2010 -477263.0        42           2011
832199  Russian Federation  1997 -433511.0        42           1998
831565              Canada  2000 -337266.0        42           2001
831558              Canada  2007 -326275.0        42           2008
831809           Indonesia  1999 -315000.0        42           2000
831555              Canada  2010 -306558.0        42           2011
832382       United States  1993 -306225.0        42           1994
831808           Indonesia  2000 -285000.0        42           2001
831557              Canada  2008 -281594.0        42           2009
831560              Canada  2005 -281249.0        42           2006
832384       United States  1991 -271616.0        42           1992
832383       United States  1992 -246416.0        42           1993
832187  Russian Federation  2009 -245159.0        42           2010
832376       United States  1999 -240625.0        42           2000
831564              Canada  2001 -230424.0        42           2002
831561              Canada  2004 -220123.0        42           2005

In [40]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [40]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[True, True, False]).groupby('country').head(50)

            country  year   quantity  category  year_plus_one
835137  Afghanistan  1990  3902100.0        42           1991
492297  Afghanistan  1990   512000.0        31           1991
491412  Afghanistan  1990   400000.0        31           1991
492006  Afghanistan  1990   112000.0        31           1991
491548  Afghanistan  1990    66000.0        31           1991
...             ...   ...        ...       ...            ...
459014        Sudan  2012     1666.0        27           2013
216857        Sudan  2012     1590.0        21           2013
239620        Sudan  2012     1590.0        21           2013
135998        Sudan  2012     1523.0        14           2013
139828        Sudan  2012     1523.0        14           2013

[12111 rows x 5 columns]

### Параметр inplace

In [56]:
data.head()

         country  year   quantity  category  year_plus_one
492605  Zimbabwe  1990  7355000.0        31           1991
491540  Zimbabwe  1990  5820000.0        31           1991
492291  Zimbabwe  1990  1535000.0        31           1991
122097  Zimbabwe  1990   965000.0        12           1991
122399  Zimbabwe  1990   965000.0        12           1991

In [54]:
data.sort_values(['country', 'year'], ascending=[False, True], inplace = True)

In [53]:
def calculation(data, inplace=True):
    data.sort_values(['country', 'year'], ascending=[False, True], inplace=True)

In [55]:
data.sort_values(['country', 'year'], ascending=[False, True], inplace=True)

In [57]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)